In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Age':[18,27,23,34,25],
      'Salary': [5000,7000,4000,2000,9000]}
df = pd.DataFrame(data)
df

   Age  Salary
0   18    5000
1   27    7000
2   23    4000
3   34    2000
4   25    9000

In [4]:
# Normalization 
df1 = (df - df.min()) / (df.max() - df.min())
df1

      Age    Salary
0  0.0000  0.428571
1  0.5625  0.714286
2  0.3125  0.285714
3  1.0000  0.000000
4  0.4375  1.000000

In [5]:
# Standardization
df2 = (df - df.mean()) / df.std()
df2

        Age    Salary
0 -1.263527 -0.148047
1  0.273195  0.592187
2 -0.409793 -0.518163
3  1.468424 -1.258396
4 -0.068299  1.332420